# Created 2018-08-30 Thu 09:18
#+OPTIONS: num:nil p:nil
#+TITLE: Untitled FIXME I sure do need a title
#+AUTHOR: Ian Eure <ian@retrospec.tv>


* Background: Lisp environments & images

Many compilers operate on a single source file at a time, producing
some kind of output representing the code it contains.  Because of
its roots as an interpreted language, Lisp does not work this way.

When you start Lisp, it initializes a *Lisp environment* in your
computer’s memory, then evaluates a *toplevel form*.  The
environment contains the Lisp language and tools; the standard
toplevel form is the REPL.  If you type code into the REPL, or load
code from a file, it’s added to the environment and can be used
inside it.  So far, this is pretty similar to how other interpreted
languages work.

Lisp differs from other interpreted languages in two important ways:
Firstly, the environment is much more comprehensive than other
languages.  Rather than separate parser, compiler, linker, and
debugger, these are built into the language, loaded into the
environment, and can be used by any Lisp programs, including yours.

This is an important point to understand.  Nearly every other
language is either unusable without multiple binaries which do
different things, or ships with a significant amount of
functionality locked up in programs which have to be run from a
shell.

For example, Python 3 ships with five binaries:

#+BEGIN_SRC shell
  dpkg -L python3-minimal | grep -c /bin/
#+END_SRC

#+RESULTS:
: 5

OpenJDK has 21:

#+BEGIN_SRC shell
  dpkg -L openjdk-8-jre-headless | grep -c /bin/
#+END_SRC

#+RESULTS:
: 21

GCC has 16:
#+BEGIN_SRC shell
  dpkg -L gcc | grep -c /bin/
#+END_SRC

#+RESULTS:
: 16

And in order to actually use GCC, you need binutils, which has
nearly 40 more:

#+BEGIN_SRC shell
  dpkg -L binutils | grep -c /bin/
#+END_SRC

#+RESULTS:
: 37

Can you guess how many Steel Bank Common Lisp (SBCL) has?

#+BEGIN_SRC shell
  dpkg -L sbcl | grep -c /bin/
#+END_SRC

#+RESULTS:
: 1

Just one, =/usr/bin/sbcl=.  Everything you can do with Lisp, you do
inside the Lisp environment.

Secondly, the environment can be saved to disk in a *Lisp image* (or
"core"), then restored from it at a later date.  When you save the
image, you can specify a toplevel form other than the REPL which
should be evaluated.

To make an executable Lisp program which you can run from a UNIX
shell, you load your code into the Lisp environment, then create an
image with the toplevel form set to your entry point.


* Version 1: Quick & dirty

The goal is to make a traditional Hello, World program which will:

1. Run from a shell.
2. Use the first argument given to it as the name of the person or
   thing to greet.

Starting from the ground up, a function to create the greeting is
needed:

#+NAME: greet
#+BEGIN_SRC lisp
  (defun greet (whom)
    "Create a greeting message for WHOM."
    (format nil "Hello, ~A." whom))
#+END_SRC

Trying this in the REPL shows that it works:

#+BEGIN_SRC lisp
  (greet "World")
#+END_SRC

#+RESULTS:
: Hello, World.


* Building an image

Because the Lisp toolchain exists inside the Lisp environment, build
scripts for Lisp project are written in, you guessed it, Lisp.

#+NAME: build
#+BEGIN_SRC lisp
  (load "hello.lisp")                     ; Load the code into the Lisp
                                          ; environment

  (save-lisp-and-die "hello"              ; Save a Lisp image
   :toplevel 'hello:main                  ; The toplevel function is
                                          ; MAIN, inside the HELLO
                                          ; package.
   :executable t)                         ; Make an executable.
#+END_SRC

For this toy example, this could just as easily be put at the end of
=hello.lisp=.  In this example’s sole not to practicality, it’s
going to go in =build.lisp=, which a more reasonable place.  If
=SAVE-LISP-AND-DIE= was in =hello.lisp=, and that file was loaded
into any Lisp environment, it would immediately terminate.  This is
unacceptably antisocial behavior, even for Lisp.

Executing the build script with =sbcl(1)= will produce the binary:

#+BEGIN_SRC shell
  sbcl --non-interactive --load build.lisp
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
This is SBCL 1.3.14.debian, an implementation of ANSI Common Lisp.
More information about SBCL is available at <http://www.sbcl.org/>.

SBCL is free software, provided as is, with absolutely no warranty.
It is mostly in the public domain; some portions are provided under
BSD-style licenses.  See the CREDITS and COPYING files in the
distribution for more information.
[undoing binding stack and other enclosing state... done]
[defragmenting immobile space... done]
[saving current Lisp image into hello:
writing 4800 bytes from the read-only space at 0x20000000
writing 3216 bytes from the static space at 0x20100000
writing 1245184 bytes from the immobile space at 0x20300000
writing 13796160 bytes from the immobile space at 0x21b00000
writing 37584896 bytes from the dynamic space at 0x1000000000
done]
#+END_EXAMPLE

Running it shows about what we’d expect:

#+BEGIN_SRC shell
  ./hello World
#+END_SRC

#+RESULTS:
: Hello, World.

Passing in the name of the current user also seems to work:

#+BEGIN_SRC shell
  ./hello $(whoami)
#+END_SRC

#+RESULTS:
: Hello, ieure.

Now that the program works, and you hopefully understand why and
how, it’s time to tear it down and rebuild it.


